app/controllers/info_controller.rb

  def who_bought
    @product = Product.find(params[:id])
    @orders = @product.orders
---
SELECT * FROM "products" WHERE ("products"."id" = 3)
SELECT "orders".* FROM "orders" INNER JOIN "line_items" ON "orders".id = "line_items".order_id WHERE (("line_items".product_id = 3))