app/controllers/store_controller.rb

INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2010-07-29 13:57:42', 4, 2, 1, 55.5, '2010-07-29 13:57:42')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('Mark', '123 something st', '2010-07-30 15:09:44', '2010-07-30 15:09:44', 'cc', 'a@sample.com')
---
  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save