app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def update
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
DELETE FROM "users" WHERE "id" = 1